src/staticresources/ACET_CallScheduleServiceMockResponse.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v6="http://upm3.uhc.com/provider/readproviderfeeschedule/v6">
   <soapenv:Header/>
   <soapenv:Body>
      <v6:invokeService>
         <!--Optional:-->
         <arg0>
            <requestHeader>
               <applicationName>ISET</applicationName>
               <applicationInstanceName>HAD</applicationInstanceName>
               <logLevel>DEFAULT</logLevel>
               <serviceOption>
                  <key>SOURCE_SYSTEM</key>
                  <value>NDB</value>
               </serviceOption>
               <serviceOption>
                  <key>SOAP_FAULTS_AS_STATUS_MESSAGE_BEANS</key>
                  <value>true</value>
               </serviceOption>
            </requestHeader>
            <sourceSystemParameters/>
            <procedureCode>99214</procedureCode>
            <modifier>24</modifier>
            <modifier>25</modifier>
            <fromDateOfService>2021-03-08</fromDateOfService>
            <toDateOfService>2021-03-08</toDateOfService>
            <percent xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <providerId>002946654</providerId>
            <market>42577</market>
            <marketType>63</marketType>
            <placeOfServiceCode>11</placeOfServiceCode>
            <productCode>EPO</productCode>
            <productOfferId>A2</productOfferId>
            <diagnosisCode>O0901</diagnosisCode>
            <icdVersionIndicator>0</icdVersionIndicator>
            <numberOfUnits>1</numberOfUnits>
            <unitType>D</unitType>
            <chargeAmount>200.00</chargeAmount>
            <ipa>604</ipa>
            <ioRateTableNumber>000000000</ioRateTableNumber>
            <feeScheduleNumber>70646</feeScheduleNumber>
            <contractPayMethod>C</contractPayMethod>
            <facilityContractCode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <taxId>824344286</taxId>
            <providerNetworkType xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
         </arg0>
      </v6:invokeService>
   </soapenv:Body>
</soapenv:Envelope>